app/Controllers/Dashboard.php

SELECT `transactions`.*, `categories`.`name` as `category_name`, `users`.`name` as `user_name`
FROM `transactions`
LEFT JOIN `categories` ON `categories`.`id` = `transactions`.`category_id`
LEFT JOIN `users` ON `users`.`id` = `transactions`.`user_id`
WHERE `scope` = 'shared'
ORDER BY `transaction_date` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();

        $role = session()->get('role');
        $userId = session()->get('user_id');

        /*
        |--------------------------------------------------------------------------
        | SHARED TRANSACTIONS
        |--------------------------------------------------------------------------
        */

        $shared = $db->table('transactions')
            ->select('transactions.*, categories.name as category_name, users.name as user_name')
            ->join('categories', 'categories.id = transactions.category_id', 'left')
            ->join('users', 'users.id = transactions.user_id', 'left')
            ->where('scope', 'shared')
            ->orderBy('transaction_date', 'DESC')
            ->get()
            ->getResultArray();

SELECT SUM(`amount`) AS `amount`
FROM `transactions`
WHERE `scope` = 'shared'
AND `type` = 'income'
SELECT SUM(`amount`) AS `amount`
FROM `transactions`
WHERE `scope` = 'shared'
AND `type` = 'expense'
---
        |--------------------------------------------------------------------------
        */

        $sharedIncome = $db->table('transactions')
            ->selectSum('amount')
            ->where('scope', 'shared')
            ->where('type', 'income')
            ->get()
            ->getRow()
            ->amount ?? 0;

        $sharedExpense = $db->table('transactions')
            ->selectSum('amount')
            ->where('scope', 'shared')
            ->where('type', 'expense')
            ->get()
            ->getRow()
            ->amount ?? 0;