app/Controllers/Transactions.php

    public function delete($id)
    {
        $db = \Config\Database::connect();

        $transaction = $db->table('transactions')
            ->where('id', $id)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `transactions`
WHERE `id` = '10'

            }
        }

        $db->table('transactions')
            ->where('id', $id)
            ->delete();
---
DELETE FROM `transactions`
WHERE `id` = '10'