app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index()
    {

        if (session()->get('role') !== 'SUPERADMIN') {
            return redirect()->to('/dashboard');
        }

        $model = new UserModel();

        return view('users/index', [
            'users' => $model->findAll()
        ]);

DELETE FROM `users`
WHERE `id` IN ('9')
---
    public function delete($id)
    {
        if (session()->get('role') !== 'SUPERADMIN') {
            return redirect()->to('/dashboard');
        }

        $model = new UserModel();
        $model->delete($id);